#### Terraform Format and Style `success`
#### Terraform Initialization `success`
#### Terraform Validation `success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan `success`

<details><summary>Show Plan</summary>

```

module.demo.aws_ssm_document.ssm_document: Refreshing state... [id=docs]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.demo.aws_ssm_document.ssm_document has changed
  ~ resource "aws_ssm_document" "ssm_document" {
        id               = "docs"
        name             = "docs"
      + permissions      = {}
        tags             = {
            "Name" = "docs"
        }
        # (17 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.demo.aws_ssm_association.test_associations will be created
  + resource "aws_ssm_association" "test_associations" {
      + apply_only_at_cron_interval = false
      + arn                         = (known after apply)
      + association_id              = (known after apply)
      + association_name            = "cq-ssm-assoc"
      + compliance_severity         = "UNSPECIFIED"
      + document_version            = (known after apply)
      + id                          = (known after apply)
      + max_concurrency             = "1"
      + max_errors                  = "10"
      + name                        = "AmazonCloudWatch-ManageAgent"
      + parameters                  = (known after apply)

      + targets {
          + key    = "tag:Environment"
          + values = [
              + "Development",
            ]
        }
    }

  # module.demo.aws_ssm_document.ssm_document must be replaced
-/+ resource "aws_ssm_document" "ssm_document" {
      ~ arn              = "arn:aws:ssm:us-east-1:707066037989:document/docs" -> (known after apply)
      ~ created_date     = "2022-03-11T09:03:23Z" -> (known after apply)
      ~ default_version  = "1" -> (known after apply)
      ~ description      = "Check ip configuration of a Linux instance." -> (known after apply)
      ~ document_version = "1" -> (known after apply)
      ~ hash             = "10d053ba192bd280f1f2d582a07652dfc688d06f3e0f30285b25f79309195fbf" -> (known after apply)
      ~ hash_type        = "Sha256" -> (known after apply)
      ~ id               = "docs" -> (known after apply)
      ~ latest_version   = "1" -> (known after apply)
      ~ name             = "docs" -> "cq-ssm-cq-provider" # forces replacement
      ~ owner            = "707066037989" -> (known after apply)
      ~ parameter        = [] -> (known after apply)
      - permissions      = {} -> null
      ~ platform_types   = [
          - "Linux",
          - "MacOS",
        ] -> (known after apply)
      ~ schema_version   = "1.2" -> (known after apply)
      ~ status           = "Active" -> (known after apply)
        tags             = {
            "Name" = "docs"
        }
        # (4 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.binary

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.binary"

```

</details>

*Pusher: @irmatov, Action: `pull_request_target`, Working Directory: ``, Workflow: `terraform_plan`*